// dotnet new console - команда создания нового проекта, инициализирует dotnet консоль и создаёт соответствующие папки C# проекта
// dotnet run - команда запуска проекта
// Через Console. идёт обращением к системному терминалу
// New Random().Next(min, max)   вместо min - минимальное max максимальное. Подобный алгоритм я использовал в зенке. Но он использовался в 2строки. Как я понял
// первая строка призывала саму функцию рандома, а вторая строка её присваивала и использовала в проекте. (Смотри генерацию строк в базе данных C# блок)
// можно призывать через присваивание. int NUBMER =  new Random().Next(min, max);
Console.WriteLine("2 Hello, World!");